send_welcome_message = """
Привет, я телеграм-бот - я помогу тебе добавить твои любимые стикеры из VK в Telegram!
Чтобы скачать стикеры, напиши мне /download ;)
"""

send_help_message = """
Список доступных команд:
    /download - скачать стикеры из VK
"""

no_filters_message = """
Я тебя не понимаю! Напиши /help для получения списка возможных команд
"""

start_download_message = """
Выберите вариант скачивания стикеров
"""

not_an_option_message = """
Такого варианта нет! Выберите один из существующих вариантов
"""

id_start_input_message = """
Введите ID первого стикера в стикер-паке
"""

id_wrong_input_message = """
Вы ввели не число (или не только его). Введите только одно целое число
"""

id_end_input_message = """
Теперь введите ID последнего стикера в стикер-паке
"""

id_first_input_message = """
Введите ID первого стикера, который хотите скачать
"""

id_input_message = """
Введите ID следующего стикера. Либо отправьте команду /done, если вы уже ввели все необходимые ID
"""

size_input_message = """
Выберите вариант размера скачиваемой картинки (в пикселях)
"""

size_wrong_input_message = """
Размер был введен некорректно. Выберите один из предложенных вариантов
"""

finish_message = """
Все готово! Если нужно что-то еще - только скажите ;)
"""