help_message = """
Чтобы узнать что я умею, нажмите на ***Меню***
👇
"""

welcome_message = """
Здравствуйте☺
Я - Telegram бот VPN-сервиса Hello world!
""" + help_message

# @Deprecated
# commands_list = [
#     "⚫ /subscribe\nОформление подписки\n",
#     "⚫ /renew\nПродлить подписку\n",
#     "⚫ /connect\nРасскажу как настроить VPN-подключение с любого устройства\n",
#     "⚫ /info\nСкажу ваши персональные данные и продолжительность подписки\n",
#     "⚫ /faq\nОтветы на часто задаваемые вопросы",
# ]
#
# available_commands_message = """
# Список возможных команд:\n
# """

you_are_welcome_message = """
Пожалуйста☺
"""

unknown_command_message = """
Извините, команда не распознана!
""" + help_message

not_an_option_message = """
Такого варианта ответа нет!☹
Если вы передумали - напишите /cancel или ***Отмена***
Клавиатура для выбора ответа тут 👇
"""
