register_user_message = """
Рады вас видеть☺
Для оформления подписки ответьте, пожалуйста, на пару вопросов
"""

choose_server_message = """
VPN какой страны предпочтете?
"""

user_already_exist_message = """
У вас уже есть подписка. Хотите продлить её?
"""

choose_subscription_duration_message = """
На какой срок вы хотите оформить подписку?
"""

payment_requisites = """
❗Обязательно❗
В комментарии к оплате укажите свой ник в Телеграм. 
Оплата будет проверена администратором в ближайшее время. После проверки вам станет доступен личный кабинет
"""

operation_canceled_message = """
Операция отменена!
"""
